//
// Created by HanJun on 2017/8/30.
//
#include<stdio.h>

//*14.请别写函数fun,函数的功能使求出二维数组周边元素之和，作为函数值返回。二维数
// 组中的值在主函数中赋予。
int fun(int **tt,int y,int x);

void main(){
    int a[10][9] = {
            {0,1,2,3,4,5,6,7,8,},
            {2,3,11,4,5,6,7,8,9,},
            {0,1,2,3,4,5,1,2,3,},
            {2,3,11,4,5,6,7,8,9,},
            {2,3,11,4,5,6,7,8,9,},
            {2,3,11,4,5,6,7,8,9,},
            {2,3,11,4,5,6,7,8,9,},
            {2,3,11,4,5,6,7,8,9,},
            {2,3,11,4,5,6,7,8,9,},
            {2,3,11,4,5,6,7,8,9,},
    };
    int *r[10];
    int y  = 10;
    int x = 9;
    for (int i = 0; i < 10; ++i) {
        r[i] = a[i];
    }
    printf("二维数组周边元素之和为%d\n",fun(r,y,x));

}
int fun(int **tt,int y,int x) {
    int s = 0;
    for (int k = 0; k < y; ++k) {
        for (int z = 0; z < x; ++z) {
            s += tt[k][z];
        }
    }
    for (int i = 1; i < y-1; ++i) {
        for (int j = 1; j < x-1; ++j) {
            s -= tt[i][j];
        }
    }
    return s;
}

