//
// Created by HanJun on 2017/9/10.
//
#include <stdio.h>

/**
73.假定输入的字符串中只包含字母和*号，请编写函数fun，它的功能是：除了字符串前导和尾部的*号之
 外，将串中其他*号全部删除。形参h已指向字符串第一个字符，形参p已指向字符串中最后一个字母。在编写程
 序时，不得使用C语言提供的字符串函数。
 **/
void main()
{
    char s[] = "**he of*a ef*4 u03u c*";
    char *h = &s[0];
    char *p = &s[21];
    int k = 0;//删除的*个数
    int f = 0;//末尾*个数

    //h指向第一个非*
    while (*h == '*'){
        h++;
    }
    //p指向最后个非*
    while (*p == '*'){
        p--;
        f++;
    }
    //删除中间的*
    while (h+k <= p) {
        *h = *(h+k);
        if (*h == '*') {
            k++;
        } else{
            h++;
        }
    }
    //拿回末尾的*
    for (int i = 0; i < f; ++i) {
        *h = '*';
        h++;
    }
    //结束字符串
    *h = '\0';
    printf("输出结果是：%s",s);
}
